{
	"version": "https://jsonfeed.org/version/1",
	"title": "Another Think Coming",
	"icon": "https://micro.blog/mguhlin/avatar.jpg",
	"home_page_url": "https://mgblog.org/",
	"feed_url": "https://mgblog.org/feed.json",
	"items": [
		
			{
				"id": "http://mguhlin.micro.blog/2025/01/24/el-silencio-no-es-una.html",
				"title": "El Silencio No es una Opción: Por Qué las Organizaciones Deben Defender la #DEI",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>La justificación de que muchas organizaciones permanecen en silencio sobre cuestiones de diversidad, equidad e inclusión (DEI) es insuficiente dado el clima político actual. Necesitamos organizaciones dispuestas a abogar y luchar en nombre de todos sus miembros, especialmente los más desfavorecidos. Muchas organizaciones han fallado consistentemente en esto porque tienen miedo de ser censuradas. Una organización que tiene miedo de defender lo que es correcto no vale la pena ser miembro de ella, especialmente cuando los programas como DEI, LGBTQ+ y la representación de minorías están cada vez más amenazados.</p>\n<p>Algunos argumentarían que estas organizaciones son apolíticas, pero como señala Elie Wiesel,</p>\n<blockquote>\n<p>“Debemos tomar partido. La neutralidad ayuda al opresor, nunca a la víctima. El silencio alienta al atormentador, nunca al atormentado. A veces debemos interferir. Cuando las vidas humanas están en peligro, cuando la dignidad humana está en juego, las fronteras nacionales y las sensibilidades se vuelven irrelevantes. Dondequiera que los hombres y mujeres sean perseguidos por su raza, religión o puntos de vista políticos, ese lugar debe - en ese momento - convertirse en el centro del universo.”</p>\n</blockquote>\n<p>Cuando la gente pregunta, &ldquo;¿Qué iniciativas o sistemas de apoyo están en marcha para grupos minoritarios como negros, hispanos, LGBTQ+ y otras comunidades subrepresentadas? ¿Quiénes son los líderes o defensores detrás de estos esfuerzos y cómo podemos involucrarnos o aprender más?&rdquo;</p>\n<p>Con demasiada frecuencia, las organizaciones guardan silencio. No tienen respuesta. Y por esa razón, cualquier organización que permanezca en silencio es un fracaso y cobarde. Para remediar esto, las organizaciones deberían:</p>\n<ol>\n<li><strong>Establecer Políticas Claras de DEI</strong>: Desarrollar e implementar políticas que promuevan la diversidad, la equidad y la inclusión.</li>\n<li><strong>Crear Sistemas de Apoyo</strong>: Establecer iniciativas y sistemas de apoyo adaptados a las necesidades de los grupos minoritarios.</li>\n<li><strong>Nombrar Defensores</strong>: Designar líderes o defensores responsables de impulsar los esfuerzos de DEI y representar a las comunidades subrepresentadas.</li>\n<li><strong>Fomentar la Participación</strong>: Proporcionar vías claras para que los miembros se involucren en las iniciativas de DEI y aprendan más sobre los esfuerzos en curso.</li>\n<li><strong>Promover la Transparencia</strong>: Comunicar regularmente a todos los miembros los objetivos, progresos y desafíos de DEI de la organización.</li>\n</ol>\n<p>Al seguir estos pasos, las organizaciones pueden demostrar su compromiso de apoyar a todos los miembros y crear un entorno más inclusivo.</p>\n<hr>\n<p>The rationale that many organizations remain silent on issues of diversity, equity, and inclusion (DEI) is insufficient given today&rsquo;s political climate. We need organizations that are willing to advocate and fight on behalf of all their members, especially the most disenfranchised. Many organizations have consistently failed to do this because they are afraid of being censured. An organization that is afraid to stand up for what is right is not worth being a member of, especially when programs like DEI, LGBTQ+, and minority representation are increasingly under threat.</p>\n<p>Some would argue that these organizations are apolitical, but as Elie Wiesel points out,</p>\n<blockquote>\n<p>“We must take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented. Sometimes we must interfere. When human lives are endangered, when human dignity is in jeopardy, national borders and sensitivities become irrelevant. Wherever men and women are persecuted because of their race, religion, or political views, that place must - at that moment - become the center of the universe.”</p>\n</blockquote>\n<p>When people ask, &ldquo;What initiatives or support systems are in place for minority groups such as Blacks, Hispanics, LGBTQ+, and other underrepresented communities? Who are the leaders or advocates behind these efforts, and how can we get involved or learn more?&rdquo;</p>\n<p>Too often, organizations are silent. They have no answer. And for that reason, any organization that remains silent may be perceived as a failure and craven. To remedy this, organizations should:</p>\n<ol>\n<li><strong>Establish Clear DEI Policies</strong>: Develop and implement policies that promote diversity, equity, and inclusion.</li>\n<li><strong>Create Support Systems</strong>: Establish initiatives and support systems tailored to the needs of minority groups.</li>\n<li><strong>Appoint Advocates</strong>: Designate leaders or advocates responsible for driving DEI efforts and representing underrepresented communities.</li>\n<li><strong>Encourage Involvement</strong>: Provide clear pathways for members to get involved in DEI initiatives and learn more about ongoing efforts.</li>\n<li><strong>Promote Transparency</strong>: Regularly communicate the organization&rsquo;s DEI goals, progress, and challenges to all members.</li>\n</ol>\n<p>By taking these steps, organizations can demonstrate their commitment to supporting all members and create a more inclusive environment.</p>\n",
				"content_text": "<div style=\"text-align: center;\">\n\n<img src=\"uploads/2025/garden.png\" width=\"600\" height=\"600\" alt=\"\">\n\n</div>\n\nLa justificación de que muchas organizaciones permanecen en silencio sobre cuestiones de diversidad, equidad e inclusión (DEI) es insuficiente dado el clima político actual. Necesitamos organizaciones dispuestas a abogar y luchar en nombre de todos sus miembros, especialmente los más desfavorecidos. Muchas organizaciones han fallado consistentemente en esto porque tienen miedo de ser censuradas. Una organización que tiene miedo de defender lo que es correcto no vale la pena ser miembro de ella, especialmente cuando los programas como DEI, LGBTQ+ y la representación de minorías están cada vez más amenazados.\n\n\nAlgunos argumentarían que estas organizaciones son apolíticas, pero como señala Elie Wiesel, \n\n> “Debemos tomar partido. La neutralidad ayuda al opresor, nunca a la víctima. El silencio alienta al atormentador, nunca al atormentado. A veces debemos interferir. Cuando las vidas humanas están en peligro, cuando la dignidad humana está en juego, las fronteras nacionales y las sensibilidades se vuelven irrelevantes. Dondequiera que los hombres y mujeres sean perseguidos por su raza, religión o puntos de vista políticos, ese lugar debe - en ese momento - convertirse en el centro del universo.”\n\n\nCuando la gente pregunta, \"¿Qué iniciativas o sistemas de apoyo están en marcha para grupos minoritarios como negros, hispanos, LGBTQ+ y otras comunidades subrepresentadas? ¿Quiénes son los líderes o defensores detrás de estos esfuerzos y cómo podemos involucrarnos o aprender más?\"\n\nCon demasiada frecuencia, las organizaciones guardan silencio. No tienen respuesta. Y por esa razón, cualquier organización que permanezca en silencio es un fracaso y cobarde. Para remediar esto, las organizaciones deberían:\n\n1. **Establecer Políticas Claras de DEI**: Desarrollar e implementar políticas que promuevan la diversidad, la equidad y la inclusión.\n2. **Crear Sistemas de Apoyo**: Establecer iniciativas y sistemas de apoyo adaptados a las necesidades de los grupos minoritarios.\n3. **Nombrar Defensores**: Designar líderes o defensores responsables de impulsar los esfuerzos de DEI y representar a las comunidades subrepresentadas.\n4. **Fomentar la Participación**: Proporcionar vías claras para que los miembros se involucren en las iniciativas de DEI y aprendan más sobre los esfuerzos en curso.\n5. **Promover la Transparencia**: Comunicar regularmente a todos los miembros los objetivos, progresos y desafíos de DEI de la organización.\n\n\nAl seguir estos pasos, las organizaciones pueden demostrar su compromiso de apoyar a todos los miembros y crear un entorno más inclusivo.\n\n---\n\nThe rationale that many organizations remain silent on issues of diversity, equity, and inclusion (DEI) is insufficient given today's political climate. We need organizations that are willing to advocate and fight on behalf of all their members, especially the most disenfranchised. Many organizations have consistently failed to do this because they are afraid of being censured. An organization that is afraid to stand up for what is right is not worth being a member of, especially when programs like DEI, LGBTQ+, and minority representation are increasingly under threat.\n\nSome would argue that these organizations are apolitical, but as Elie Wiesel points out, \n\n> “We must take sides. Neutrality helps the oppressor, never the victim. Silence encourages the tormentor, never the tormented. Sometimes we must interfere. When human lives are endangered, when human dignity is in jeopardy, national borders and sensitivities become irrelevant. Wherever men and women are persecuted because of their race, religion, or political views, that place must - at that moment - become the center of the universe.”\n\nWhen people ask, \"What initiatives or support systems are in place for minority groups such as Blacks, Hispanics, LGBTQ+, and other underrepresented communities? Who are the leaders or advocates behind these efforts, and how can we get involved or learn more?\"\n\nToo often, organizations are silent. They have no answer. And for that reason, any organization that remains silent may be perceived as a failure and craven. To remedy this, organizations should:\n\n1. **Establish Clear DEI Policies**: Develop and implement policies that promote diversity, equity, and inclusion.\n2. **Create Support Systems**: Establish initiatives and support systems tailored to the needs of minority groups.\n3. **Appoint Advocates**: Designate leaders or advocates responsible for driving DEI efforts and representing underrepresented communities.\n4. **Encourage Involvement**: Provide clear pathways for members to get involved in DEI initiatives and learn more about ongoing efforts.\n5. **Promote Transparency**: Regularly communicate the organization's DEI goals, progress, and challenges to all members.\n\nBy taking these steps, organizations can demonstrate their commitment to supporting all members and create a more inclusive environment.\n",
				"date_published": "2025-01-24T21:00:00-06:00",
				"url": "https://mgblog.org/2025/01/24/el-silencio-no-es-una.html",
				"tags": ["Opinion","Spanish"]
			},
			{
				"id": "http://mguhlin.micro.blog/2025/01/24/una-corona-de-carbones-encendidos.html",
				"title": "Una Corona de Carbones Encendidos: US DoE Dumps #DEI",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>Solo puede haber una respuesta a la <a href=\"https://www.ed.gov/about/news/press-release/us-department-of-education-takes-action-eliminate-dei\"><strong>proclamación del Departamento de Educación de los EE. UU</strong></a>. de la administración presidencial de 2025, mostrada anteriormente, que califica la DEI como ILEGAL.</p>\n<blockquote>\n<p>El Departamento de Educación de los Estados Unidos ha tomado medidas para eliminar iniciativas dañinas de Diversidad, Equidad e Inclusión (DEI), incluidas las referencias a ellas en los canales de comunicación públicos y en su fuerza laboral asociada. Estas acciones están en línea con el compromiso continuo del presidente Trump de acabar con la discriminación ilegal y el gasto innecesario en todo el gobierno federal.</p>\n</blockquote>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>Podrías decir, con toda intención y premeditación, que el Departamento de Educación de los EE. UU. ha tomado medidas prejuiciosas para marcar a los ciudadanos estadounidenses como ilegales, infractores de la ley y proscritos.</p>\n<p>Bueno, amigos (y enemigos), dejemos una cosa clara. Cuando la alternativa es ser PROSCRITO por tratar a los seres humanos con dignidad y respeto, entonces los proscritos cabalgarán de nuevo.</p>\n<p>Invocaría una cita antigua para respaldar esta lógica, pero ¿saben qué? No es necesario. Esto está mal, y si lo respaldan con su silencio, esa es su decisión.</p>\n<p>Que cosechen las recompensas de la injusticia mil veces, y que se les acumulen como una corona de carbones encendidos.</p>\n<hr>\n<p>There can only be one response to the <a href=\"https://www.ed.gov/about/news/press-release/us-department-of-education-takes-action-eliminate-dei\">** 2025 presidential administration&rsquo;s U.S. Department of Education proclamation**</a> shown that labels DEI as ILLEGAL.</p>\n<blockquote>\n<p>The U.S. Department of Education has taken action to eliminate harmful Diversity, Equity, and Inclusion (DEI) initiatives, including references to them in public-facing communication channels and its associated workforce. These actions are in line with President Trump’s ongoing commitment to end illegal discrimination and wasteful spending across the federal government.</p>\n</blockquote>\n<p>You may as well say, the US DoE willfully and with malice aforethought taken prejudicial action to brand American citizens as illegals, as lawbreakers, and outlaws.</p>\n<p>Well, friends (and enemies), let&rsquo;s be clear about one thing. When the alternative is being OUTLAWED for treating human beings with dignity and respect, then outlaws will ride again.</p>\n<p>I would invoke an ancient quote to support this rationale, but you know what, it isn&rsquo;t necessary. This is wrong, and if you endorse it with your silence, then that&rsquo;s your decision.</p>\n<p>May you reap the rewards of injustice  a thousand fold, and may it be heaped upon you like a flaming crown of coals.</p>\n<blockquote>\n<p>&ldquo;You may not control all the events that happen to you, but you can decide not to be reduced by them. I can be changed by what happens to me. But I refuse to be reduced by it.&rdquo; <!-- raw HTML omitted --></p>\n</blockquote>\n<ul>\n<li>Maya Angelou</li>\n</ul>\n",
				"content_text": "<div style=\"text-align: center;\">\n\n<img src=\"uploads/2025/man2.png\" width=\"600\" height=\"600\" alt=\"\">\n<br>\n\"You may write me down in history with your bitter, twisted lies, you may trod me in the very dirt, but still, like dust, I'll rise.\" \n<br>\n- Maya Angelou\n\n</div>\n\nSolo puede haber una respuesta a la [**proclamación del Departamento de Educación de los EE. UU**](https://www.ed.gov/about/news/press-release/us-department-of-education-takes-action-eliminate-dei). de la administración presidencial de 2025, mostrada anteriormente, que califica la DEI como ILEGAL.\n\n\n> El Departamento de Educación de los Estados Unidos ha tomado medidas para eliminar iniciativas dañinas de Diversidad, Equidad e Inclusión (DEI), incluidas las referencias a ellas en los canales de comunicación públicos y en su fuerza laboral asociada. Estas acciones están en línea con el compromiso continuo del presidente Trump de acabar con la discriminación ilegal y el gasto innecesario en todo el gobierno federal.\n\n<div style=\"text-align: center;\">\n\n<img src=\"uploads/2025/usdoe-dei.png.jpeg\" width=\"600\" height=\"651\" alt=\"\">\n\n</div>\n\nPodrías decir, con toda intención y premeditación, que el Departamento de Educación de los EE. UU. ha tomado medidas prejuiciosas para marcar a los ciudadanos estadounidenses como ilegales, infractores de la ley y proscritos.\n\n\nBueno, amigos (y enemigos), dejemos una cosa clara. Cuando la alternativa es ser PROSCRITO por tratar a los seres humanos con dignidad y respeto, entonces los proscritos cabalgarán de nuevo.\n\nInvocaría una cita antigua para respaldar esta lógica, pero ¿saben qué? No es necesario. Esto está mal, y si lo respaldan con su silencio, esa es su decisión.\n\nQue cosechen las recompensas de la injusticia mil veces, y que se les acumulen como una corona de carbones encendidos.\n\n---\nThere can only be one response to the [** 2025 presidential administration's U.S. Department of Education proclamation**](https://www.ed.gov/about/news/press-release/us-department-of-education-takes-action-eliminate-dei) shown that labels DEI as ILLEGAL.\n\n> The U.S. Department of Education has taken action to eliminate harmful Diversity, Equity, and Inclusion (DEI) initiatives, including references to them in public-facing communication channels and its associated workforce. These actions are in line with President Trump’s ongoing commitment to end illegal discrimination and wasteful spending across the federal government. \n\nYou may as well say, the US DoE willfully and with malice aforethought taken prejudicial action to brand American citizens as illegals, as lawbreakers, and outlaws.\n\nWell, friends (and enemies), let's be clear about one thing. When the alternative is being OUTLAWED for treating human beings with dignity and respect, then outlaws will ride again.\n\nI would invoke an ancient quote to support this rationale, but you know what, it isn't necessary. This is wrong, and if you endorse it with your silence, then that's your decision.\n\nMay you reap the rewards of injustice  a thousand fold, and may it be heaped upon you like a flaming crown of coals.\n\n> \"You may not control all the events that happen to you, but you can decide not to be reduced by them. I can be changed by what happens to me. But I refuse to be reduced by it.\" <br>\n- Maya Angelou\n",
				"date_published": "2025-01-24T20:00:00-06:00",
				"url": "https://mgblog.org/2025/01/24/una-corona-de-carbones-encendidos.html",
				"tags": ["Opinion"]
			},
			{
				"id": "http://mguhlin.micro.blog/2025/01/23/boycotting-dei-reducers.html",
				"title": "Boycotting #DEI Reducers",
				"content_html": "<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n<p>As I saw the Big Tech folks at the Inauguration event, I&rsquo;ve seen some decide to cut or reduce their Diversity, Equity, and Inclusion policies. I loved that Apple re-affirmed its support of DEI. The whole thing made me wonder though.</p>\n<p>&ldquo;Is it time for a boycott of those technologies?&rdquo; Then I asked myself, &ldquo;What happens if I review every entity that touches my life (hey, as many as I could of think of in the time I had to write this blog entry), and ask whether they have a DEI policy or not?&rdquo;</p>\n<p>Could having a DEI policy be that important and be relied upon as criteria for boycotting a business if NOT?</p>\n<hr>\n<p><em><strong>AI-Generated Content inside these horizontal bars</strong></em></p>\n<h2 id=\"why-dei-is-important\">Why DEI is Important</h2>\n<p>The following is a definition of DEI via AI:</p>\n<h3 id=\"definition-of-diversity-equity-and-inclusion-dei\">Definition of Diversity, Equity, and Inclusion (DEI)</h3>\n<p><strong>Diversity:</strong> Diversity refers to the presence of differences within a group or organization. These differences can include, but are not limited to, race, ethnicity, gender, sexual orientation, age, religion, disability, and socioeconomic status. Diversity aims to create an environment where various perspectives and experiences are represented and valued.</p>\n<p><strong>Equity:</strong> Equity involves ensuring fairness and justice by addressing systemic disadvantages and providing equal opportunities for all individuals. Unlike equality, which focuses on treating everyone the same, equity acknowledges that different people have different needs and circumstances, and aims to level the playing field by providing resources and support tailored to those needs.</p>\n<p><strong>Inclusion:</strong> Inclusion is the practice of ensuring that diverse individuals feel valued, respected, and fully integrated into a group or organization. It involves creating an environment where everyone has a sense of belonging and can fully participate and contribute. Inclusion goes beyond mere representation and focuses on the quality of interactions and experiences within a diverse setting.</p>\n<h3 id=\"why-some-want-to-ban-dei\">Why Some Want to Ban DEI</h3>\n<p>These reasons are via AI, as well.</p>\n<p>There are several reasons why some individuals or groups might advocate for banning DEI initiatives:</p>\n<ol>\n<li>\n<p><strong>Political and Ideological Differences:</strong> Some people view DEI as a politically charged concept that aligns with certain ideologies they oppose. They may see DEI as promoting a particular political agenda rather than fostering genuine inclusion and fairness.</p>\n</li>\n<li>\n<p><strong>Perceived Reverse Discrimination:</strong> Critics argue that DEI initiatives can lead to reverse discrimination, where efforts to promote equity for underrepresented groups result in unfair treatment of other groups. They believe that focusing on equity can disadvantage those who are not part of the targeted groups.</p>\n</li>\n<li>\n<p><strong>Concerns About Meritocracy:</strong> Some argue that DEI initiatives undermine meritocracy by prioritizing diversity and equity over individual qualifications and achievements. They believe that opportunities should be based solely on merit, without consideration of demographic factors.</p>\n</li>\n<li>\n<p><strong>Resource Allocation:</strong> There are concerns about the allocation of resources for DEI programs. Critics may argue that funds and efforts could be better spent on other initiatives that benefit a broader range of people.</p>\n</li>\n<li>\n<p><strong>Cultural and Social Resistance:</strong> In some communities or organizations, there may be cultural or social resistance to change. People may be uncomfortable with the idea of acknowledging and addressing systemic inequalities, preferring to maintain the status quo.</p>\n</li>\n<li>\n<p><strong>Misunderstanding of DEI Concepts:</strong> Some opposition stems from a lack of understanding or misinterpretation of what DEI entails. People may have misconceptions about the goals and methods of DEI initiatives, leading to resistance.</p>\n</li>\n<li>\n<p><strong>Fear of Conflict:</strong> DEI initiatives often involve addressing sensitive and controversial topics, which can lead to conflict and discomfort. Some people may prefer to avoid these issues to maintain harmony, even if it means ignoring underlying problems.</p>\n</li>\n<li>\n<p><strong>Legal and Regulatory Concerns:</strong> In some cases, there may be legal or regulatory concerns about implementing DEI policies, especially in environments where affirmative action or similar initiatives are contentious or restricted by law.</p>\n</li>\n</ol>\n<p><em><strong>AI-Generated Content inside these horizontal bars</strong></em></p>\n<hr>\n<h2 id=\"a-decision\">A Decision</h2>\n<p>In light of recent reports about organizations scaling back their Diversity, Equity, and Inclusion (DEI) efforts, I have decided to reassess where I spend my time, energy, and money. DEI is not just a buzzword; it is a commitment to creating spaces where everyone—regardless of their background—can thrive.</p>\n<p>After careful consideration, I have chosen to do either a partial or full boycott of companies that have reduced their DEI initiatives. This decision stems from a firm belief that maintaining robust DEI efforts is essential for building a fair and inclusive society. Companies that fail to prioritize these principles not only miss an opportunity to lead but also risk fostering environments that exclude marginalized voices.</p>\n<p>My actions will focus on:</p>\n<ul>\n<li>Prioritizing businesses that actively uphold DEI values—supporting companies that demonstrate leadership and integrity in this area.</li>\n<li>Reducing or discontinuing use of services from companies scaling back DEI efforts, unless there are no viable alternatives for essential needs.</li>\n<li>Engaging directly with organizations whose DEI commitments have diminished to voice my concerns and urge them to reinvest in these critical initiatives.</li>\n<li>This is not a decision I make lightly, as I understand that companies face various pressures. However, I believe it is our collective responsibility as consumers to hold organizations accountable for their choices and to reward those that actively work toward equity and inclusion.</li>\n</ul>\n<p>I encourage others to join me in reflecting on where we direct our resources and how our spending can shape a better future. Every dollar spent is a vote for the kind of world we want to see. Let’s make those votes count.</p>\n<p>Together, we can advocate for meaningful change.</p>\n<h2 id=\"wait-i-cant-boycott-vendorname\">Wait, I can&rsquo;t Boycott [VendorName]</h2>\n<p>If you are having problems considering boycotting a specific vendor, I&rsquo;m right there with you. Consider a partial boycott.</p>\n<h3 id=\"amazon\">Amazon</h3>\n<p>For me, that vendor would be Amazon. I currently subscribe to:</p>\n<ul>\n<li>Amazon Prime</li>\n<li>Amazon Kindle Unlimited</li>\n<li>Amazon Prime Video</li>\n<li>Amazon Music</li>\n<li>Audible</li>\n</ul>\n<p>Amazon has made it difficult to cut ties with them. So, I&rsquo;m going for a partial boycott. I will keep Kindle Unlimited and Audible. Over time, I will slowly walk away from those. Even if I listened to my entire Audible collection again, that would be years of listening&hellip;and who doesn&rsquo;t love to read books a second time?</p>\n<h3 id=\"spectrum\">Spectrum</h3>\n<p>Another vendor that I can&rsquo;t boycott at all is Spectrum. It&rsquo;s my mobile AND data provider, and has done a great job with both. There&rsquo;s no way I&rsquo;m switching to AT&amp;T. If only T-Mobile had not had so many data breaches.</p>\n<p>As you might imagine, it&rsquo;s going to take a while to put these boycotts in place.</p>\n<h2 id=\"what-yes-no-reduced-mean\">What YES, NO, REDUCED mean</h2>\n<p>Here is an explanation of what each label means. The one to take a hard look at is the REDUCED list.</p>\n<ul>\n<li>\n<p><strong>YES</strong>: The organization actively maintains and supports Diversity, Equity, and Inclusion (DEI) initiatives without evidence of scaling back.</p>\n</li>\n<li>\n<p><strong>No info available</strong>: There is no publicly available information about the organization&rsquo;s DEI policies or actions, and no indication of reductions or changes.</p>\n</li>\n<li>\n<p><strong>Reduced</strong>: The organization has scaled back, discontinued, or significantly altered its DEI initiatives, <strong>as publicly reported</strong>.</p>\n</li>\n</ul>\n<h2 id=\"the-list\">The List</h2>\n<p>This list is subject to change or get updated.</p>\n<h3 id=\"automotive\"><strong>Automotive</strong></h3>\n<ul>\n<li><strong>Ford Motor Company</strong>: Reduced (2023)</li>\n<li><strong>Gunn Nissan</strong>: YES</li>\n<li><strong>Harley-Davidson</strong>: Reduced (2024)</li>\n<li><strong>John Deere</strong>: Reduced (2024)</li>\n<li><strong>Mac Haik Toyota</strong>: No info available</li>\n</ul>\n<hr>\n<h3 id=\"book-retailers\"><strong>Book Retailers</strong></h3>\n<ul>\n<li><strong>Half Price Books</strong>: No info available</li>\n</ul>\n<hr>\n<h3 id=\"education-associations\"><strong>Education Associations</strong></h3>\n<ul>\n<li><strong>ASCD</strong>: YES</li>\n<li><strong>ISTE</strong>: YES</li>\n<li><strong>TCEA</strong>: No info available</li>\n</ul>\n<hr>\n<h3 id=\"educational-institutions\"><strong>Educational Institutions</strong></h3>\n<ul>\n<li><strong>Cotulla ISD</strong>: No info available</li>\n<li><strong>Edgewood ISD</strong>: No info available</li>\n<li><strong>Harlandale ISD</strong>: No info available</li>\n<li><strong>Northside ISD</strong>: No info available</li>\n<li><strong>San Antonio ISD</strong>: YES</li>\n<li><strong>University of Missouri</strong>: Reduced (2024)</li>\n</ul>\n<hr>\n<h3 id=\"hospitality-and-hotels\"><strong>Hospitality and Hotels</strong></h3>\n<ul>\n<li><strong>Choice Hotels</strong>: YES</li>\n<li><strong>Hilton</strong>: YES</li>\n<li><strong>IHG</strong>: YES</li>\n</ul>\n<hr>\n<h3 id=\"restaurants-and-food-chains\"><strong>Restaurants and Food Chains</strong></h3>\n<ul>\n<li><strong>LongHorn Steakhouse</strong>: No info available</li>\n<li><strong>McDonald&rsquo;s</strong>: Reduced (2023)</li>\n<li><strong>Saltgrass Steak House</strong>: No info available</li>\n<li><strong>Sea Island</strong>: No info available</li>\n<li><strong>Texas Roadhouse</strong>: No info available</li>\n<li><strong>Whataburger</strong>: YES</li>\n</ul>\n<hr>\n<h3 id=\"retail-and-consumer-goods\"><strong>Retail and Consumer Goods</strong></h3>\n<ul>\n<li><strong>Home Depot</strong>: YES</li>\n<li><strong>Kohl&rsquo;s</strong>: YES</li>\n<li><strong>Lowe&rsquo;s</strong>: Reduced (2024)</li>\n<li><strong>Tractor Supply Company</strong>: Reduced (2024)</li>\n<li><strong>Walmart</strong>: Reduced (2024)</li>\n</ul>\n<hr>\n<h3 id=\"streamingvideo-services\"><strong>Streaming/Video Services</strong></h3>\n<ul>\n<li><strong>Fandango</strong>: YES</li>\n<li><strong>Hulu</strong>: YES</li>\n<li><strong>Netflix</strong>: YES</li>\n<li><strong>Paramount</strong>: YES</li>\n<li><strong>Peacock</strong>: YES</li>\n<li><strong>Roku</strong>: YES</li>\n</ul>\n<hr>\n<h3 id=\"technology-and-ai\"><strong>Technology and AI</strong></h3>\n<ul>\n<li><strong>Amazon</strong>: Reduced (2024)</li>\n<li><strong>Anthropic</strong>: YES</li>\n<li><strong>Apple</strong>: YES</li>\n<li><strong>Google</strong>: YES</li>\n<li><strong>Mistral</strong>: No info available</li>\n<li><strong>OpenAI</strong>: YES</li>\n<li><strong>Perplexity</strong>: No info available</li>\n<li><strong>Slack</strong>: YES</li>\n<li><strong>Spectrum</strong>: Reduced (2024)</li>\n</ul>\n<h2 id=\"potential-boycott-candidates-on-the-reduced-list\">Potential Boycott Candidates on the Reduced List</h2>\n<p>It&rsquo;s funny, I tried to get ChatGPT to give me a list of companies to boycott based on criteria but it could only generate an error. It handled everything up to that point quite well (and everything after), but balked at producing a boycott list.</p>\n<!-- raw HTML omitted -->\n<p>So, I appealed to Mistral and obtained these results:</p>\n<table>\n<thead>\n<tr>\n<th>Company Name</th>\n<th>Industry</th>\n<th>2022 Record</th>\n<th>2023 Record</th>\n<th>2024 Record</th>\n<th>Boycott Recommendation</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Amazon</td>\n<td>Technology and AI</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>Ford Motor Company</td>\n<td>Automotive</td>\n<td>-</td>\n<td>Reduced</td>\n<td>-</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>Harley-Davidson</td>\n<td>Automotive</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>John Deere</td>\n<td>Automotive</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>Lowe&rsquo;s</td>\n<td>Retail and Consumer Goods</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>McDonald&rsquo;s</td>\n<td>Restaurants and Food Chains</td>\n<td>-</td>\n<td>Reduced</td>\n<td>-</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>Spectrum</td>\n<td>Technology and AI</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>Tractor Supply Company</td>\n<td>Retail and Consumer Goods</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>University of Missouri</td>\n<td>Educational Institutions</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n<tr>\n<td>Walmart</td>\n<td>Retail and Consumer Goods</td>\n<td>-</td>\n<td>-</td>\n<td>Reduced</td>\n<td>Boycott</td>\n</tr>\n</tbody>\n</table>\n<h2 id=\"should-i-boycott-them\">Should I boycott them?</h2>\n<p>To determine whether I should boycott the businesses, I decided to employ the ETHICAL framework. Here is it&rsquo;s reasoning:</p>\n<p>Let&rsquo;s apply the <a href=\"https://chatgpt.com/g/g-677c910194c881918aa10e48eb2ea933-ethical-analysis-gpt\"><strong>ETHICAL Decision-Making Model</strong></a> to your question about boycotting services with reduced DEI efforts. This will help you systematically assess the implications and develop an informed course of action.</p>\n<hr>\n<h3 id=\"1-engage-stakeholders\">1. <strong>Engage Stakeholders</strong></h3>\n<p>The decision to boycott involves various parties:</p>\n<ul>\n<li><strong>You</strong> (and any others participating in the boycott): Personal and ethical satisfaction.</li>\n<li><strong>Organizations being boycotted</strong>: Potential revenue loss and public reputation impact.</li>\n<li><strong>DEI advocates</strong>: Support for their work by reinforcing DEI&rsquo;s importance.</li>\n<li><strong>Employees and customers of these companies</strong>: Potential impacts on their jobs or services.</li>\n<li><strong>Broader community</strong>: Awareness and cultural shifts regarding DEI.</li>\n</ul>\n<hr>\n<h3 id=\"2-think-emotionally-and-logically\">2. <strong>Think Emotionally and Logically</strong></h3>\n<ul>\n<li><strong>Emotionally</strong>: Frustration and disappointment with companies reducing DEI initiatives may drive the desire for action. However, empathy is important for understanding organizational constraints and employee perspectives.</li>\n<li><strong>Logically</strong>: Consider the effectiveness of boycotting. Will it lead to meaningful change? Could it inadvertently harm employees or services you value?</li>\n</ul>\n<hr>\n<h3 id=\"3-harmonize-perspectives\">3. <strong>Harmonize Perspectives</strong></h3>\n<ul>\n<li><strong>Your viewpoint</strong>: Committed to supporting DEI initiatives and holding companies accountable.</li>\n<li><strong>Organizational perspective</strong>: Companies reducing DEI may cite economic challenges, political pressures, or shifting priorities.</li>\n<li><strong>DEI advocates</strong>: Likely view boycotting as a tool to pressure companies.</li>\n<li><strong>Employees</strong>: May feel caught between corporate decisions and public backlash.</li>\n</ul>\n<hr>\n<h3 id=\"4-investigate-options\">4. <strong>Investigate Options</strong></h3>\n<p>Options for action:</p>\n<ol>\n<li>Boycott all &ldquo;Reduced&rdquo; companies.\n<ul>\n<li><strong>Pros</strong>: Sends a strong message supporting DEI.</li>\n<li><strong>Cons</strong>: Potential unintended consequences, like harming employees who may already be marginalized.</li>\n</ul>\n</li>\n<li>Limit usage (e.g., REDUCED tier companies for non-essential services only).\n<ul>\n<li><strong>Pros</strong>: Balances ethical concerns and personal needs.</li>\n<li><strong>Cons</strong>: May dilute the impact of the boycott.</li>\n</ul>\n</li>\n<li>Continue using their services but advocate for DEI initiatives directly.\n<ul>\n<li><strong>Pros</strong>: Maintains access while still promoting change.</li>\n<li><strong>Cons</strong>: May not send as strong a public signal.</li>\n</ul>\n</li>\n<li>Focus boycotts on specific industries or companies with the most publicized reductions (e.g., Ford or Walmart).\n<ul>\n<li><strong>Pros</strong>: Targeted pressure could yield more tangible results.</li>\n<li><strong>Cons</strong>: Less comprehensive.</li>\n</ul>\n</li>\n</ol>\n<hr>\n<h3 id=\"5-collaborate-on-recommendations\">5. <strong>Collaborate on Recommendations</strong></h3>\n<p>Based on the analysis, a balanced recommendation might be:</p>\n<ul>\n<li><strong>Prioritize supporting YES companies</strong>: Reward those with strong DEI commitments.</li>\n<li><strong>Engage with REDUCED companies</strong>: Write to express concerns and encourage DEI reinvestment.</li>\n<li><strong>Consider partial boycotts</strong>: Avoiding REDUCED companies for discretionary spending while allowing essential use.</li>\n</ul>\n<hr>\n<h3 id=\"6-authorize-decision\">6. <strong>Authorize Decision</strong></h3>\n<p>You hold the final authority to determine your own actions. Consider gathering insights from like-minded peers or DEI-focused groups to refine your approach.</p>\n<hr>\n<h3 id=\"7-launch-implementation\">7. <strong>Launch Implementation</strong></h3>\n<p>To put your decision into action:</p>\n<ol>\n<li>Draft a personal or public statement clarifying your stance and intended actions.</li>\n<li>Inform companies of your reasons for boycotting or reducing usage.</li>\n<li>Share your plan to encourage others to support DEI initiatives.</li>\n</ol>\n",
				"content_text": "<div style=\"text-align: center;\">\n\n<img src=\"uploads/2025/detailed-view-of-leather-cardholder.jpeg\" width=\"600\" height=\"600\" alt=\"\">\n\n</div>\n\n\nAs I saw the Big Tech folks at the Inauguration event, I've seen some decide to cut or reduce their Diversity, Equity, and Inclusion policies. I loved that Apple re-affirmed its support of DEI. The whole thing made me wonder though.\n\n\n\"Is it time for a boycott of those technologies?\" Then I asked myself, \"What happens if I review every entity that touches my life (hey, as many as I could of think of in the time I had to write this blog entry), and ask whether they have a DEI policy or not?\"\n\n\nCould having a DEI policy be that important and be relied upon as criteria for boycotting a business if NOT?\n\n\n---\n***AI-Generated Content inside these horizontal bars***\n\n\n## Why DEI is Important\n\n\nThe following is a definition of DEI via AI:\n\n\n### Definition of Diversity, Equity, and Inclusion (DEI)\n\n\n**Diversity:** Diversity refers to the presence of differences within a group or organization. These differences can include, but are not limited to, race, ethnicity, gender, sexual orientation, age, religion, disability, and socioeconomic status. Diversity aims to create an environment where various perspectives and experiences are represented and valued.\n\n\n**Equity:** Equity involves ensuring fairness and justice by addressing systemic disadvantages and providing equal opportunities for all individuals. Unlike equality, which focuses on treating everyone the same, equity acknowledges that different people have different needs and circumstances, and aims to level the playing field by providing resources and support tailored to those needs.\n\n\n**Inclusion:** Inclusion is the practice of ensuring that diverse individuals feel valued, respected, and fully integrated into a group or organization. It involves creating an environment where everyone has a sense of belonging and can fully participate and contribute. Inclusion goes beyond mere representation and focuses on the quality of interactions and experiences within a diverse setting.\n\n\n### Why Some Want to Ban DEI\nThese reasons are via AI, as well.\n\n\nThere are several reasons why some individuals or groups might advocate for banning DEI initiatives:\n\n\n1. **Political and Ideological Differences:** Some people view DEI as a politically charged concept that aligns with certain ideologies they oppose. They may see DEI as promoting a particular political agenda rather than fostering genuine inclusion and fairness.\n\n\n2. **Perceived Reverse Discrimination:** Critics argue that DEI initiatives can lead to reverse discrimination, where efforts to promote equity for underrepresented groups result in unfair treatment of other groups. They believe that focusing on equity can disadvantage those who are not part of the targeted groups.\n\n\n3. **Concerns About Meritocracy:** Some argue that DEI initiatives undermine meritocracy by prioritizing diversity and equity over individual qualifications and achievements. They believe that opportunities should be based solely on merit, without consideration of demographic factors.\n\n\n4. **Resource Allocation:** There are concerns about the allocation of resources for DEI programs. Critics may argue that funds and efforts could be better spent on other initiatives that benefit a broader range of people.\n\n\n5. **Cultural and Social Resistance:** In some communities or organizations, there may be cultural or social resistance to change. People may be uncomfortable with the idea of acknowledging and addressing systemic inequalities, preferring to maintain the status quo.\n\n\n6. **Misunderstanding of DEI Concepts:** Some opposition stems from a lack of understanding or misinterpretation of what DEI entails. People may have misconceptions about the goals and methods of DEI initiatives, leading to resistance.\n\n\n7. **Fear of Conflict:** DEI initiatives often involve addressing sensitive and controversial topics, which can lead to conflict and discomfort. Some people may prefer to avoid these issues to maintain harmony, even if it means ignoring underlying problems.\n\n\n8. **Legal and Regulatory Concerns:** In some cases, there may be legal or regulatory concerns about implementing DEI policies, especially in environments where affirmative action or similar initiatives are contentious or restricted by law.\n\n\n\n\n***AI-Generated Content inside these horizontal bars***\n\n\n---\n\n\n## A Decision\nIn light of recent reports about organizations scaling back their Diversity, Equity, and Inclusion (DEI) efforts, I have decided to reassess where I spend my time, energy, and money. DEI is not just a buzzword; it is a commitment to creating spaces where everyone—regardless of their background—can thrive.\n\n\nAfter careful consideration, I have chosen to do either a partial or full boycott of companies that have reduced their DEI initiatives. This decision stems from a firm belief that maintaining robust DEI efforts is essential for building a fair and inclusive society. Companies that fail to prioritize these principles not only miss an opportunity to lead but also risk fostering environments that exclude marginalized voices.\n\n\nMy actions will focus on:\n\n\n- Prioritizing businesses that actively uphold DEI values—supporting companies that demonstrate leadership and integrity in this area.\n- Reducing or discontinuing use of services from companies scaling back DEI efforts, unless there are no viable alternatives for essential needs.\n- Engaging directly with organizations whose DEI commitments have diminished to voice my concerns and urge them to reinvest in these critical initiatives.\n- This is not a decision I make lightly, as I understand that companies face various pressures. However, I believe it is our collective responsibility as consumers to hold organizations accountable for their choices and to reward those that actively work toward equity and inclusion.\n\n\nI encourage others to join me in reflecting on where we direct our resources and how our spending can shape a better future. Every dollar spent is a vote for the kind of world we want to see. Let’s make those votes count.\n\n\nTogether, we can advocate for meaningful change.\n\n\n## Wait, I can't Boycott [VendorName]\nIf you are having problems considering boycotting a specific vendor, I'm right there with you. Consider a partial boycott. \n\n\n### Amazon\nFor me, that vendor would be Amazon. I currently subscribe to:\n\n\n- Amazon Prime\n- Amazon Kindle Unlimited\n- Amazon Prime Video\n- Amazon Music\n- Audible\n\n\nAmazon has made it difficult to cut ties with them. So, I'm going for a partial boycott. I will keep Kindle Unlimited and Audible. Over time, I will slowly walk away from those. Even if I listened to my entire Audible collection again, that would be years of listening...and who doesn't love to read books a second time?\n\n\n### Spectrum\nAnother vendor that I can't boycott at all is Spectrum. It's my mobile AND data provider, and has done a great job with both. There's no way I'm switching to AT&T. If only T-Mobile had not had so many data breaches.\n\n\nAs you might imagine, it's going to take a while to put these boycotts in place.\n\n\n## What YES, NO, REDUCED mean\n\n\nHere is an explanation of what each label means. The one to take a hard look at is the REDUCED list.\n\n\n- **YES**: The organization actively maintains and supports Diversity, Equity, and Inclusion (DEI) initiatives without evidence of scaling back.\n\n\n- **No info available**: There is no publicly available information about the organization's DEI policies or actions, and no indication of reductions or changes.\n\n\n- **Reduced**: The organization has scaled back, discontinued, or significantly altered its DEI initiatives, **as publicly reported**.\n\n\n## The List\n\n\nThis list is subject to change or get updated.\n\n\n### **Automotive**\n\n\n- **Ford Motor Company**: Reduced (2023)  \n- **Gunn Nissan**: YES  \n- **Harley-Davidson**: Reduced (2024)  \n- **John Deere**: Reduced (2024)  \n- **Mac Haik Toyota**: No info available  \n\n\n---\n\n\n### **Book Retailers**\n\n\n- **Half Price Books**: No info available  \n\n\n---\n\n\n### **Education Associations**\n\n\n- **ASCD**: YES  \n- **ISTE**: YES  \n- **TCEA**: No info available  \n\n\n---\n\n\n### **Educational Institutions**\n\n\n- **Cotulla ISD**: No info available  \n- **Edgewood ISD**: No info available  \n- **Harlandale ISD**: No info available  \n- **Northside ISD**: No info available  \n- **San Antonio ISD**: YES  \n- **University of Missouri**: Reduced (2024)  \n\n\n---\n\n\n### **Hospitality and Hotels**\n\n\n- **Choice Hotels**: YES  \n- **Hilton**: YES  \n- **IHG**: YES  \n\n\n---\n\n\n### **Restaurants and Food Chains**\n\n\n- **LongHorn Steakhouse**: No info available  \n- **McDonald's**: Reduced (2023)  \n- **Saltgrass Steak House**: No info available  \n- **Sea Island**: No info available  \n- **Texas Roadhouse**: No info available  \n- **Whataburger**: YES  \n\n\n---\n\n\n### **Retail and Consumer Goods**\n\n\n- **Home Depot**: YES  \n- **Kohl's**: YES  \n- **Lowe's**: Reduced (2024)  \n- **Tractor Supply Company**: Reduced (2024)  \n- **Walmart**: Reduced (2024)  \n\n\n---\n\n\n### **Streaming/Video Services**\n\n\n- **Fandango**: YES\n- **Hulu**: YES  \n- **Netflix**: YES  \n- **Paramount**: YES  \n- **Peacock**: YES  \n- **Roku**: YES  \n\n\n---\n\n\n### **Technology and AI**\n\n\n- **Amazon**: Reduced (2024)  \n- **Anthropic**: YES\n- **Apple**: YES\n- **Google**: YES  \n- **Mistral**: No info available  \n- **OpenAI**: YES  \n- **Perplexity**: No info available  \n- **Slack**: YES  \n- **Spectrum**: Reduced (2024)  \n\n\n## Potential Boycott Candidates on the Reduced List\n\n\nIt's funny, I tried to get ChatGPT to give me a list of companies to boycott based on criteria but it could only generate an error. It handled everything up to that point quite well (and everything after), but balked at producing a boycott list.\n\n\n<img src=\"uploads/2025/error.png\" width=\"600\" height=\"201\" alt=\"\">\n\n\nSo, I appealed to Mistral and obtained these results:\n\n\n| Company Name             | Industry                  | 2022 Record | 2023 Record | 2024 Record | Boycott Recommendation |\n|--------------------------|---------------------------|-------------|-------------|-------------|------------------------|\n| Amazon                   | Technology and AI         | -           | -           | Reduced     | Boycott                |\n| Ford Motor Company       | Automotive                | -           | Reduced     | -           | Boycott                |\n| Harley-Davidson          | Automotive                | -           | -           | Reduced     | Boycott                |\n| John Deere               | Automotive                | -           | -           | Reduced     | Boycott                |\n| Lowe's                   | Retail and Consumer Goods | -           | -           | Reduced     | Boycott                |\n| McDonald's               | Restaurants and Food Chains| -         | Reduced     | -           | Boycott                |\n| Spectrum                 | Technology and AI         | -           | -           | Reduced     | Boycott                |\n| Tractor Supply Company   | Retail and Consumer Goods | -           | -           | Reduced     | Boycott                |\n| University of Missouri    | Educational Institutions  | -           | -           | Reduced     | Boycott                |\n| Walmart                  | Retail and Consumer Goods | -           | -           | Reduced     | Boycott                |\n\n\n\n\n## Should I boycott them?\nTo determine whether I should boycott the businesses, I decided to employ the ETHICAL framework. Here is it's reasoning:\n\n\nLet's apply the [**ETHICAL Decision-Making Model**](https://chatgpt.com/g/g-677c910194c881918aa10e48eb2ea933-ethical-analysis-gpt) to your question about boycotting services with reduced DEI efforts. This will help you systematically assess the implications and develop an informed course of action.\n\n\n---\n\n\n### 1. **Engage Stakeholders**\nThe decision to boycott involves various parties:\n- **You** (and any others participating in the boycott): Personal and ethical satisfaction.\n- **Organizations being boycotted**: Potential revenue loss and public reputation impact.\n- **DEI advocates**: Support for their work by reinforcing DEI's importance.\n- **Employees and customers of these companies**: Potential impacts on their jobs or services.\n- **Broader community**: Awareness and cultural shifts regarding DEI.\n\n\n---\n\n\n### 2. **Think Emotionally and Logically**\n- **Emotionally**: Frustration and disappointment with companies reducing DEI initiatives may drive the desire for action. However, empathy is important for understanding organizational constraints and employee perspectives.\n- **Logically**: Consider the effectiveness of boycotting. Will it lead to meaningful change? Could it inadvertently harm employees or services you value?\n\n\n---\n\n\n### 3. **Harmonize Perspectives**\n- **Your viewpoint**: Committed to supporting DEI initiatives and holding companies accountable.\n- **Organizational perspective**: Companies reducing DEI may cite economic challenges, political pressures, or shifting priorities.\n- **DEI advocates**: Likely view boycotting as a tool to pressure companies.\n- **Employees**: May feel caught between corporate decisions and public backlash.\n\n\n---\n\n\n### 4. **Investigate Options**\nOptions for action:\n1. Boycott all \"Reduced\" companies.\n   - **Pros**: Sends a strong message supporting DEI.\n   - **Cons**: Potential unintended consequences, like harming employees who may already be marginalized.\n2. Limit usage (e.g., REDUCED tier companies for non-essential services only).\n   - **Pros**: Balances ethical concerns and personal needs.\n   - **Cons**: May dilute the impact of the boycott.\n3. Continue using their services but advocate for DEI initiatives directly.\n   - **Pros**: Maintains access while still promoting change.\n   - **Cons**: May not send as strong a public signal.\n4. Focus boycotts on specific industries or companies with the most publicized reductions (e.g., Ford or Walmart).\n   - **Pros**: Targeted pressure could yield more tangible results.\n   - **Cons**: Less comprehensive.\n\n\n---\n\n\n### 5. **Collaborate on Recommendations**\nBased on the analysis, a balanced recommendation might be:\n- **Prioritize supporting YES companies**: Reward those with strong DEI commitments.\n- **Engage with REDUCED companies**: Write to express concerns and encourage DEI reinvestment.\n- **Consider partial boycotts**: Avoiding REDUCED companies for discretionary spending while allowing essential use.\n\n\n---\n\n\n### 6. **Authorize Decision**\nYou hold the final authority to determine your own actions. Consider gathering insights from like-minded peers or DEI-focused groups to refine your approach.\n\n\n---\n\n\n### 7. **Launch Implementation**\nTo put your decision into action:\n1. Draft a personal or public statement clarifying your stance and intended actions.\n2. Inform companies of your reasons for boycotting or reducing usage.\n3. Share your plan to encourage others to support DEI initiatives.\n\n\n\n",
				"date_published": "2025-01-23T19:00:00-06:00",
				"url": "https://mgblog.org/2025/01/23/boycotting-dei-reducers.html",
				"tags": ["Opinion","ETHICAL"]
			},
			{
				"id": "http://mguhlin.micro.blog/2025/01/22/antisocial-bambi.html",
				"title": "Anti-Social Bambi",
				"content_html": "<!-- raw HTML omitted -->\n<p>Un colega publicó <a href=\"https://www.theatlantic.com/magazine/archive/2025/02/american-loneliness-personality-politics/681091/?gift=32piWY3HlZQ5ElFnvY6nmIvlyCQNmNQPtxvFkJ-q0oU&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=share\"><strong>El siglo antisocial</strong></a>, un artículo de <em>The Atlantic</em>. El artículo afirma:</p>\n<blockquote>\n<p>Los estadounidenses ahora pasan más tiempo solos que nunca. Está cambiando nuestras personalidades, nuestra política e incluso nuestra relación con la realidad.</p>\n</blockquote>\n<p>Una parte de mí se rió mientras leía el artículo. Como escritor y creativo por trabajo, paso mucho tiempo inhalando las ideas y conversaciones de tantas personas. A menudo me siento como la interpretación de Jim Carrey del Enigma, o El Acertijo, en una película de Batman de hace unos años. No aquella donde había un asesino pelirrojo que mataba a los asistentes al teatro. Ya sabes, esa parte de la película donde Enigma consume los pensamientos e intereses de los televidentes de Gotham. Su cerebro comienza a derretirse.</p>\n<p>Salir es un buen contrapeso a eso, ¿no? Puedes ver y hablar con personas. Pero hay cautela en cada interacción, especialmente hoy, cuando los locos han tomado el control. Ya sabes, esas personas que eligieron votar por un violador condenado. Podrías encontrarte con uno de los 1,500 alborotadores indultados. Cuando la ley y el orden no son, es una locura salir desprotegido. Puedes esperar la bondad de los extraños, pero no puedes, ni deberías, confiar en ella jamás.</p>\n<p>Mientras las matanzas del pasado rápidamente se amontonaban en mi mente, como un carrusel de diapositivas exponiendo el alma retorcida de América, me encontré respondiendo con una lengua en la mejilla llena de temor a esta parte. Cuando el precio de la libertad es morir en un tiroteo en un Luby&rsquo;s, o que comprar en Walmart termine en un tiroteo por un fanático con un rifle de asalto, o cuando adorar significa literalmente ir a visitar a tu Creador, cortesía de un rifle de asalto (no mencionaré los tiroteos en las escuelas, pero están ahí, ¿no? Como espectros del tamaño de niños, acusando con sus vidas truncadas por otros jóvenes empapados en sangre)&hellip; bueno, sí, mi hogar es mi santuario.</p>\n<p>Al menos, espero que lo sea.</p>\n<blockquote>\n<p>&ldquo;Creo que la gente se siente incómoda en el mundo hoy en día. Han decidido que su hogar es su santuario. No es fácil lograr que salgan.&rdquo;</p>\n</blockquote>\n<p>Dado el aumento de los tiroteos en escuelas, masacres en restaurantes y atrocidades en teatros, simpatizo y soy una de esas personas que ven los espacios comunes como lugares peligrosos, no muy distintos a esa película popular de cazadores de ciervos de antaño. Por supuesto, me refiero a <em>Bambi</em>, no a <em>The Deer Hunter</em>.</p>\n<p>La alegría de &ldquo;<a href=\"https://www.youtube.com/watch?v=fOy5fVsx0RQ\"><strong>El prado</strong></a>&rdquo; ha expirado hace mucho, considerando a los psicópatas armados que no pueden esperar para demostrar su derecho a portar armas haciéndolo y, tal vez, eliminando a algunos por cualquier razón enferma. Incluso el Año Nuevo es un recordatorio de que estamos bautizados en sangre.</p>\n<p>Mis restaurantes favoritos son aquellos con poca concurrencia. Nos sentamos con la espalda contra la pared, nuestros ojos en las entradas y salidas planeadas. Empiezo a pensar que, tal vez, las cosas han cambiado demasiado. Luego, recuerdo al pistolero firme en esas películas del Oeste americano que veía de niño, y me doy cuenta: &ldquo;Dios mío, he tomado mi teléfono inteligente con mi mano derecha.&rdquo;</p>\n<p>&ldquo;Allá afuera, estamos desprotegidos&rdquo;, dice la madre de Bambi. Una advertencia que cualquiera que salga de su casa debería tomar en cuenta hoy en día.</p>\n<p>Como dijeron los Cuáqueros hace mucho tiempo: &ldquo;Confía en el Señor, pero mantén tu pólvora seca.&rdquo;</p>\n<hr>\n<!-- raw HTML omitted -->\n<p>A colleague posted <a href=\"https://www.theatlantic.com/magazine/archive/2025/02/american-loneliness-personality-politics/681091/?gift=32piWY3HlZQ5ElFnvY6nmIvlyCQNmNQPtxvFkJ-q0oU&amp;utm_source=copy-link&amp;utm_medium=social&amp;utm_campaign=share\"><strong>The Anti-Social Century</strong></a>, an article from The Atlantic. The article asserts:</p>\n<blockquote>\n<p>Americans are now spending more time alone than ever. It’s changing our personalities, our politics, and even our relationship to reality.</p>\n</blockquote>\n<p>A part of me laughed as I read the article. As a writer and creative for work, I spend a lot of time inhaling the ideas and conversations of so many people. I often feel like Jim Carrey&rsquo;s portrayal of Enigma, or The Riddler, in a Batman flick a few years ago. Not the one where there was a red-haired murderer who slew theater patrons. You know, that part of the film where Enigma consumes the thoughts and interests of Gotham&rsquo;s television viewers. His brain begins to melt.</p>\n<p>Going out is a nice counter to that, isn&rsquo;t it? You get to see and talk to people. But there&rsquo;s caution in every interaction, especially today, when nuts have taken over. You know, those people who chose to vote for a convicted rapist. You might run into one of the 1500 pardoned rioters. When law and order isn&rsquo;t, it&rsquo;s foolish to be venture out unprotected. You can hope for the kindness of strangers, but you can&rsquo;t, shouldn&rsquo;t ever rely on it.</p>\n<p>As the killings of yesteryear quickly rolled up in my mind, like a slide carousel exposing the twisted soul of America, I found myself responding with tongue in cheek trepidation to this portion. When the price of freedom is death by shooting at a Luby&rsquo;s, or shopping at Walmart ends in shooting by a bigot with an assault rifle, or when worshipping means literally going to visit your Maker, courtesy of an assault rifle (I won&rsquo;t mention school shootings but they hover there, don&rsquo;t they, like child-size specters, accusing with their forlorn lives cut short by other young people steeped in blood)&hellip;well, yes, my home is my sanctuary.</p>\n<p>At least, I hope it is.</p>\n<blockquote>\n<p>“I think people feel uncomfortable in the world today. They’ve decided that their home is their sanctuary. It’s not easy to get them to leave.”</p>\n</blockquote>\n<p>Given the rise in school shootings, restaurant slaughters, and theater atrocities, I sympathize and am one of those people who views the commons as a place of danger, not unlike that popular deer hunter movie from an age ago. Of course, I mean Bambi, not The Deer Hunter.</p>\n<p>The joy of &ldquo;<a href=\"https://www.youtube.com/watch?v=fOy5fVsx0RQ\"><strong>The Meadow!</strong></a>&rdquo; has long expired given the gun-totin' psychos that can&rsquo;t wait to prove their right to carry by doing just that and maybe bagging a few for whatever sicko reason. Even New Year&rsquo;s is a reminder that we are baptized in blood.</p>\n<p>My favorite restaurants are those scarcely attended. We sit with our backs to the wall, our eyes on entryways and exits planned out. I start to think, maybe things have changed too much. Then, I remember the rock-steady gunslinger in those American Westerns I grew up watching as a kid, and I realize, &ldquo;My goodness, I&rsquo;ve picked up my smartphone with my right hand.&rdquo;</p>\n<p>&ldquo;Out there, we are unprotected,&rdquo; says Bambi&rsquo;s mother. A caution anyone who steps out of their house these days should heed.</p>\n<p>As the Quakers said so long ago, &ldquo;Trust in the Lord, but keep your powder dry.&rdquo;</p>\n",
				"content_text": "<img src=\"uploads/2025/the-meadow.png\" width=\"600\" height=\"208\" alt=\"\">\n\n\n\n\n\nUn colega publicó [**El siglo antisocial**](https://www.theatlantic.com/magazine/archive/2025/02/american-loneliness-personality-politics/681091/?gift=32piWY3HlZQ5ElFnvY6nmIvlyCQNmNQPtxvFkJ-q0oU&utm_source=copy-link&utm_medium=social&utm_campaign=share), un artículo de *The Atlantic*. El artículo afirma:\n\n\n\n\n> Los estadounidenses ahora pasan más tiempo solos que nunca. Está cambiando nuestras personalidades, nuestra política e incluso nuestra relación con la realidad.\n\n\n\nUna parte de mí se rió mientras leía el artículo. Como escritor y creativo por trabajo, paso mucho tiempo inhalando las ideas y conversaciones de tantas personas. A menudo me siento como la interpretación de Jim Carrey del Enigma, o El Acertijo, en una película de Batman de hace unos años. No aquella donde había un asesino pelirrojo que mataba a los asistentes al teatro. Ya sabes, esa parte de la película donde Enigma consume los pensamientos e intereses de los televidentes de Gotham. Su cerebro comienza a derretirse.\n\n\n\nSalir es un buen contrapeso a eso, ¿no? Puedes ver y hablar con personas. Pero hay cautela en cada interacción, especialmente hoy, cuando los locos han tomado el control. Ya sabes, esas personas que eligieron votar por un violador condenado. Podrías encontrarte con uno de los 1,500 alborotadores indultados. Cuando la ley y el orden no son, es una locura salir desprotegido. Puedes esperar la bondad de los extraños, pero no puedes, ni deberías, confiar en ella jamás.\n\n\n\nMientras las matanzas del pasado rápidamente se amontonaban en mi mente, como un carrusel de diapositivas exponiendo el alma retorcida de América, me encontré respondiendo con una lengua en la mejilla llena de temor a esta parte. Cuando el precio de la libertad es morir en un tiroteo en un Luby's, o que comprar en Walmart termine en un tiroteo por un fanático con un rifle de asalto, o cuando adorar significa literalmente ir a visitar a tu Creador, cortesía de un rifle de asalto (no mencionaré los tiroteos en las escuelas, pero están ahí, ¿no? Como espectros del tamaño de niños, acusando con sus vidas truncadas por otros jóvenes empapados en sangre)... bueno, sí, mi hogar es mi santuario.\n\n\n\n\nAl menos, espero que lo sea.\n\n\n\n> \"Creo que la gente se siente incómoda en el mundo hoy en día. Han decidido que su hogar es su santuario. No es fácil lograr que salgan.\"\n\n\n\n\nDado el aumento de los tiroteos en escuelas, masacres en restaurantes y atrocidades en teatros, simpatizo y soy una de esas personas que ven los espacios comunes como lugares peligrosos, no muy distintos a esa película popular de cazadores de ciervos de antaño. Por supuesto, me refiero a *Bambi*, no a *The Deer Hunter*.\n\n\n\n\nLa alegría de \"[**El prado**](https://www.youtube.com/watch?v=fOy5fVsx0RQ)\" ha expirado hace mucho, considerando a los psicópatas armados que no pueden esperar para demostrar su derecho a portar armas haciéndolo y, tal vez, eliminando a algunos por cualquier razón enferma. Incluso el Año Nuevo es un recordatorio de que estamos bautizados en sangre.\n\nMis restaurantes favoritos son aquellos con poca concurrencia. Nos sentamos con la espalda contra la pared, nuestros ojos en las entradas y salidas planeadas. Empiezo a pensar que, tal vez, las cosas han cambiado demasiado. Luego, recuerdo al pistolero firme en esas películas del Oeste americano que veía de niño, y me doy cuenta: \"Dios mío, he tomado mi teléfono inteligente con mi mano derecha.\"\n\n\n\n\n\"Allá afuera, estamos desprotegidos\", dice la madre de Bambi. Una advertencia que cualquiera que salga de su casa debería tomar en cuenta hoy en día.\n\n\n\n\nComo dijeron los Cuáqueros hace mucho tiempo: \"Confía en el Señor, pero mantén tu pólvora seca.\"\n\n\n---\n\n<img src=\"uploads/2025/the-meadow.png\" width=\"600\" height=\"208\" alt=\"\">\n\nA colleague posted [**The Anti-Social Century**](https://www.theatlantic.com/magazine/archive/2025/02/american-loneliness-personality-politics/681091/?gift=32piWY3HlZQ5ElFnvY6nmIvlyCQNmNQPtxvFkJ-q0oU&utm_source=copy-link&utm_medium=social&utm_campaign=share), an article from The Atlantic. The article asserts:\n\n> Americans are now spending more time alone than ever. It’s changing our personalities, our politics, and even our relationship to reality.\n\n A part of me laughed as I read the article. As a writer and creative for work, I spend a lot of time inhaling the ideas and conversations of so many people. I often feel like Jim Carrey's portrayal of Enigma, or The Riddler, in a Batman flick a few years ago. Not the one where there was a red-haired murderer who slew theater patrons. You know, that part of the film where Enigma consumes the thoughts and interests of Gotham's television viewers. His brain begins to melt.\n\nGoing out is a nice counter to that, isn't it? You get to see and talk to people. But there's caution in every interaction, especially today, when nuts have taken over. You know, those people who chose to vote for a convicted rapist. You might run into one of the 1500 pardoned rioters. When law and order isn't, it's foolish to be venture out unprotected. You can hope for the kindness of strangers, but you can't, shouldn't ever rely on it.\n\nAs the killings of yesteryear quickly rolled up in my mind, like a slide carousel exposing the twisted soul of America, I found myself responding with tongue in cheek trepidation to this portion. When the price of freedom is death by shooting at a Luby's, or shopping at Walmart ends in shooting by a bigot with an assault rifle, or when worshipping means literally going to visit your Maker, courtesy of an assault rifle (I won't mention school shootings but they hover there, don't they, like child-size specters, accusing with their forlorn lives cut short by other young people steeped in blood)...well, yes, my home is my sanctuary. \n\nAt least, I hope it is.\n\n> “I think people feel uncomfortable in the world today. They’ve decided that their home is their sanctuary. It’s not easy to get them to leave.”\n\nGiven the rise in school shootings, restaurant slaughters, and theater atrocities, I sympathize and am one of those people who views the commons as a place of danger, not unlike that popular deer hunter movie from an age ago. Of course, I mean Bambi, not The Deer Hunter.\n\nThe joy of \"[**The Meadow!**](https://www.youtube.com/watch?v=fOy5fVsx0RQ)\" has long expired given the gun-totin' psychos that can't wait to prove their right to carry by doing just that and maybe bagging a few for whatever sicko reason. Even New Year's is a reminder that we are baptized in blood.\n\nMy favorite restaurants are those scarcely attended. We sit with our backs to the wall, our eyes on entryways and exits planned out. I start to think, maybe things have changed too much. Then, I remember the rock-steady gunslinger in those American Westerns I grew up watching as a kid, and I realize, \"My goodness, I've picked up my smartphone with my right hand.\"\n\n\"Out there, we are unprotected,\" says Bambi's mother. A caution anyone who steps out of their house these days should heed.\n\nAs the Quakers said so long ago, \"Trust in the Lord, but keep your powder dry.\" \n",
				"date_published": "2025-01-22T17:30:00-06:00",
				"url": "https://mgblog.org/2025/01/22/antisocial-bambi.html",
				"tags": ["Opinion","Spanish"]
			},
			{
				"id": "http://mguhlin.micro.blog/2025/01/20/oh-bother-cant-they-get.html",
				"title": "Handwriting Study Update",
				"content_html": "<p>Oh, bother. Can&rsquo;t they get the study right?</p>\n<blockquote>\n<p>Should you whip out a notebook or a laptop to take notes?</p>\n</blockquote>\n<blockquote>\n<p>The answer is not so simple.</p>\n</blockquote>\n<p>You will want to read the whole piece:</p>\n<blockquote>\n<p>&ldquo;when taking notes by hand, “it is impossible to write down everything, so students have to process the incoming information, summarize it, and link it to knowledge they already have.” That helps the “new information to stick better, resulting in better retention.&rdquo;\n<a href=\"https://hechingerreport.org/proof-points-writing-versus-typing-learning/\">source</a></p>\n</blockquote>\n<p>I have noticed increased memory in my own note-taking by hand, but the real value does seem to be in revisiting my notes and trying to &ldquo;do something with them.&rdquo; Having live-blogged events, I noticed that it was easy to switch my brain off and type. It&rsquo;s harder when you handwrite your notes to summarize (.45), outline and organize (.84), concept mapping (.66) and do your best to put it in your own words. That&rsquo;s why audio recording is helpful&hellip;you can listen to it again and again, taking notes, drawing concept maps, engaging in quadrant note-taking, etc.</p>\n<!-- raw HTML omitted -->\n<p>The challenge is learning how to do that, and THEN, revisiting your notes 2-3 days later, then again seven days later, etc. to ensure long-term information retention. But my personal experience isn&rsquo;t proof. We need scientific research for that.</p>\n<h2 id=\"on-a-journey-from-hypothesis-evidence-poor-to-theory-evidence-rich\">On a Journey from Hypothesis (Evidence Poor) to Theory (Evidence Rich)</h2>\n<p>This image captures the journey from hypothesis to theory&hellip;the science is still coming in, so to speak, but it&rsquo;s leaning towards the right. But that, again, is for the scientists to decide. And I don&rsquo;t think we are there yet.</p>\n<!-- raw HTML omitted -->\n<p>We&rsquo;ll have to wait and see what more studies say. That study aside, consider:</p>\n<blockquote>\n<p>In kids, studies show that tracing out ABCs, as opposed to typing them, leads to better and longer-lasting recognition and understanding of letters. Writing by hand also improves memory and recall of words, laying down the foundations of literacy and learning. In adults, taking notes by hand during a lecture, instead of typing, can lead to better conceptual understanding of material.</p>\n</blockquote>\n<blockquote>\n<p>&ldquo;There&rsquo;s actually some very important things going on during the embodied experience of writing by hand,&rdquo; says Ramesh Balasubramaniam, a neuroscientist at the University of California, Merced. &ldquo;It has important cognitive benefits.&rdquo; (<a href=\"https://www.npr.org/sections/health-shots/2024/05/11/1250529661/handwriting-cursive-typing-schools-learning-brain\"><strong>source</strong></a>)</p>\n</blockquote>\n<p>What are your thoughts?</p>\n",
				"content_text": "Oh, bother. Can't they get the study right?\n\n> Should you whip out a notebook or a laptop to take notes?\n\n> The answer is not so simple. \n\nYou will want to read the whole piece:\n\n> \"when taking notes by hand, “it is impossible to write down everything, so students have to process the incoming information, summarize it, and link it to knowledge they already have.” That helps the “new information to stick better, resulting in better retention.\" \n[source](https://hechingerreport.org/proof-points-writing-versus-typing-learning/)\n\nI have noticed increased memory in my own note-taking by hand, but the real value does seem to be in revisiting my notes and trying to \"do something with them.\" Having live-blogged events, I noticed that it was easy to switch my brain off and type. It's harder when you handwrite your notes to summarize (.45), outline and organize (.84), concept mapping (.66) and do your best to put it in your own words. That's why audio recording is helpful...you can listen to it again and again, taking notes, drawing concept maps, engaging in quadrant note-taking, etc. \n\n<img src=\"https://mglinks.org/uploads/2025/ebbinghaus-forgetting-curve.webp\" width=\"600\" height=\"337\" alt=\"\">\n\nThe challenge is learning how to do that, and THEN, revisiting your notes 2-3 days later, then again seven days later, etc. to ensure long-term information retention. But my personal experience isn't proof. We need scientific research for that.\n\n## On a Journey from Hypothesis (Evidence Poor) to Theory (Evidence Rich)\nThis image captures the journey from hypothesis to theory...the science is still coming in, so to speak, but it's leaning towards the right. But that, again, is for the scientists to decide. And I don't think we are there yet.\n\n<img src=\"https://mglinks.org/uploads/2025/scientific-knowledge-is-tentative-infographic-1024x576.png\" width=\"600\" height=\"337\" alt=\"\">\n\nWe'll have to wait and see what more studies say. That study aside, consider:\n\n> In kids, studies show that tracing out ABCs, as opposed to typing them, leads to better and longer-lasting recognition and understanding of letters. Writing by hand also improves memory and recall of words, laying down the foundations of literacy and learning. In adults, taking notes by hand during a lecture, instead of typing, can lead to better conceptual understanding of material.\n\n> \"There's actually some very important things going on during the embodied experience of writing by hand,\" says Ramesh Balasubramaniam, a neuroscientist at the University of California, Merced. \"It has important cognitive benefits.\" ([**source**](https://www.npr.org/sections/health-shots/2024/05/11/1250529661/handwriting-cursive-typing-schools-learning-brain))\n\nWhat are your thoughts?\n",
				"date_published": "2025-01-20T06:38:20-06:00",
				"url": "https://mgblog.org/2025/01/20/oh-bother-cant-they-get.html",
				"tags": ["MyNotes"]
			}
	]
}
